public class Main {
    public static void main(String[] args) {
        //Реализуйте программу, которая считает стоимость покупки, учитывая НДС. Т.е. дана стоимость товара и размер НДС (например, 19%) Ваша программа должна рассчитать, сколько, сколько вы должны оплатить, учитывая налог.

        //Объявляем переменные цены и НДС;
        double price = 130.15;
        double tax = 12.5;

        // Расчитываем значение  НДС;
        double valueTax = tax / 100 * price;

        // Расчитываем цену товара вместе с НДС и округляем её до двух значений после запятой;
        String priceFinish = String.format("%.2f", (price + valueTax));

        // Выводим результиат на экран
        System.out.println("Цена товара с НДС  равна " + priceFinish + " евро");
    }
}