public class Main {
    public static void main(String[] args) {
        System.out.println("First level ");
        // First level: Представьте, что вы пишите программу для онлайн кинотеатра. У вас известно возрастное ограничение  фильма и возраст клиента (естественно заданы в виде переменных). Ваша программа должна  выдавать на экран: «вы можете смотреть этот фильм» или «данный контент вам не доступен»

        int age = 18;
        int category = 18;
        String result;


        if (age >= category) {
            result = "Вы можете смотреть этот фильм";
        } else {
            result = "Данный контент вам не доступен";
        }
        System.out.println(result);
        System.out.println("---------------------------------------------------------------------------------------");
        System.out.println("Second level ");

        //Second level: Представьте, Вы пишите программу  для расчета штрафов за превышение скорости. В качестве исходных данных у вас: ограничение скорости на данном участке дороги, скорость, с которой двигался автомобиль и признак того, что нарушение было совершено на автобане. Естественно, все три значения заданы переменными. Таблица штрафов такая:
        //
        //
        //
        //превышение менее 10% от скоростного ограничения – не штрафуется
        //
        //10% - менее 20%   от скоростного ограничения – 50 евро
        //
        //20% - менее 30%   от скоростного ограничения – 150 евро не на автобане, и 200 на автобане
        //
        //от 30% и выше  - 500евро плюс, если нарушение на автобане, лишение прав на 3 месяца.
        //Реализуйте программу, которая рассчитывает штраф и выводит соответствующее сообщение на экран.



        int speed = 120;
        int speedLimit = 80;
        boolean street = false;
        int fine = 0;
        int speedHigh = speed * 100 / speedLimit - 100;
        String result1 = " ";




        if ((speedHigh < 10)) {
            result1 = "Вы нарушили скоростной режим незначительно. Вам нужно уплатить штраф " ;
            fine = 0;
        } else
            if ((speedHigh >= 10 && speedHigh < 20) )  {
                result1 = "Вы превысили допустимую скорость. Вам нужно уплатить штраф ";
                fine = 50;

        } else
        if ((speedHigh >= 20 && speedHigh < 30) & street) {
                result1 = "Вы превысили допустимую скорость . Вам нужно уплатить  штраф ";
                fine = 150;
        } else
        if ((speedHigh >= 20 && speedHigh < 30) & !street)  {
            result1 = "Вы превысили допустимую скорость . Вам нужно уплатить штраф ";
            fine = 200;
        } else
        if ((speedHigh >= 30) & street) {
            result1 = "Вы превысили допустимую скорость. Вам нужно уплатить штраф ";
            fine=500;
        } else
       if ((speedHigh >= 30) & !street) {
            fine = 500;
            result1 = "Вы превысили допустимую скорость. Вы лишаетесь прав на 3 месяца и вам нужно уплатить штраф " ;
        }

        System.out.println(result1 + fine + " евро.");
    }
 }

